{
  "backend/main.mo": "Core Motoko canister defining user profiles, products, orders, commissions, referral bonuses, wallets, payouts, and access-controlled queries/mutations with in-memory maps and ID counters.",
  "backend/migration.mo": "Migration script converting old userProfiles to the new format by adding the referredByAssociateId field.",
  "backend/migration/Validation.mo": "Simple validation helper providing empty‑text check.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components for onboarding and referral updates.",
  "frontend-file-summaries.txt": "High‑level descriptions of all major frontend files, their purposes, and behavior.",
  "frontend/index.css": "Tailwind base styles and theme variables defining light/dark color systems and global UI tokens.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main client script.",
  "frontend/src/App.tsx": "Main React router setup with authentication gating, profile‑setup modal logic, and route definitions for all pages.",
  "frontend/src/components/common/QueryState.tsx": "Reusable loading, error, and empty‑state UI components.",
  "frontend/src/components/formatters/moneyTime.ts": "Utility functions for formatting INR currency and bigint timestamps into readable strings.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper with navigation, containerized content, and authenticated footer.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation bar component showing user, admin, and mobile nav links with logout handling based on identity and admin status.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile with validation, referral handling, and mutations to save or register the profile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, referrals, admin checks, and related backend mutations.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables with green-focused design tokens.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Simple page showing an access denied message with a button to return to the dashboard.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin page for managing products, including listing, creating, editing, and marking ID-eligible products with dialog-based form handling.",
  "frontend/src/pages/admin/AdminPayoutsPage.tsx": "Admin interface to review, approve, or reject payout requests with status filtering and user profile lookup.",
  "frontend/src/pages/CatalogItemPage.tsx": "Displays a product’s details, allows quantity input, and submits an order after authentication.",
  "frontend/src/pages/CatalogPage.tsx": "Lists all products and services, grouped by category, with navigation to individual item pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user profile metrics including referrals, earnings, and orders, with a referral link copy feature.",
  "frontend/src/pages/EarningsPage.tsx": "Provides detailed earnings, commissions, and bonus history with filtering and summary cards.",
  "frontend/src/pages/NetworkPage.tsx": "Displays the user’s downline structure with member details and counts for each referral level.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and button to return home.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays details of a single order, including product info, totals, and status, after validating identity and fetching order and product data.",
  "frontend/src/pages/OrdersPage.tsx": "Shows a table of the user's order history with product names, status, totals, and navigation to individual order pages.",
  "frontend/src/pages/PayoutsPage.tsx": "Provides a dashboard for viewing earnings, submitting payout requests, and listing payout request history with validation and status handling.",
  "frontend/src/pages/ProfilePage.tsx": "Loads and displays the user's profile data with an edit mode for updating personal and associate information.",
  "frontend/src/pages/ReferralsPage.tsx": "Displays referral code and link sharing tools and lists direct referrals with their basic profile data.",
  "frontend/src/pages/SignInPage.tsx": "Renders a branded sign‑in screen that triggers Internet Identity login and redirects authenticated users to the dashboard.",
  "frontend/src/utils/referrals.ts": "Helper functions to build referral links, read referral codes from URLs, and copy text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Metadata describing the application's project state, requirements, architecture notes, and known issues."
}