{
  "backend/main.mo": "Defines backend actor with authorization, user profiles, products, orders, commissions, referral bonuses, payout requests, and related storage maps and counters.",
  "feature_evidence.json": "Lists feature evidence for referral bonus updates and admin product designation, including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for all frontend files, describing their roles in routing, UI, data fetching, and admin features.",
  "frontend/index.css": "Defines Tailwind CSS theme variables and dark mode styles for the frontend.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router, authentication gating, root layout, profile setup modal, and all app routes.",
  "frontend/src/components/common/QueryState.tsx": "Reusable loading, error, and empty state UI components.",
  "frontend/src/components/formatters/moneyTime.ts": "Provides currency and date formatting utilities for bigint values.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout including navigation, content wrapper, and footer with attribution.",
  "frontend/src/components/layout/AppNav.tsx": "Navigation bar with role-based links, mobile menu, user dropdown, and logout handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with optional referral handling and calls to profile and referral mutations.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including login, logout, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, referrals, roles, products, orders, and other backend interactions.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light/dark modes and global styling overrides.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and Internet Identity provider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Simple page showing an access-denied message with navigation back to the dashboard.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for managing products, including listing, creating, editing, and assigning ID‑products, restricted to admin users.",
  "frontend/src/pages/admin/AdminPayoutsPage.tsx": "Admin page that lists payout requests, lets admins approve or reject them, and displays pending and processed payouts.",
  "frontend/src/pages/CatalogItemPage.tsx": "Product detail page allowing authenticated users to view product info, set quantity, and place orders.",
  "frontend/src/pages/CatalogPage.tsx": "Displays products and services fetched from the backend, redirecting unauthenticated users and organizing items into product and service grids.",
  "frontend/src/pages/DashboardPage.tsx": "Loads and displays user profile, referrals, earnings, and orders, providing a business overview and referral link copying.",
  "frontend/src/pages/EarningsPage.tsx": "Shows earnings metrics and detailed commission and bonus histories with filter controls for levels.",
  "frontend/src/pages/NetworkPage.tsx": "Fetches and displays the user’s downline counts and member details across levels 1 and 2.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and button to return home.",
  "frontend/src/pages/OrderDetailPage.tsx": "Shows detailed order info including product details, status, pricing, and navigation back to the orders list.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user's order history with product info, status, and navigation to order details, requiring authentication.",
  "frontend/src/pages/PayoutsPage.tsx": "Shows earnings, payout balance, and past payout requests while allowing users to submit new withdrawal requests.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile details such as name, email, and phone.",
  "frontend/src/pages/ReferralsPage.tsx": "Provides referral code/link sharing and displays a table of direct referrals with basic profile info.",
  "frontend/src/pages/SignInPage.tsx": "Presents an Internet Identity sign‑in button and redirects logged‑in users to the dashboard.",
  "frontend/src/utils/referrals.ts": "Utility functions for building referral links, reading referral codes from the URL, and copying text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL or hash parameters, persisting them in sessionStorage, and removing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing the MLM app's goals, architecture notes, known issues, and implemented features."
}