{
  "backend/main.mo": "Motoko canister defining user profiles, products, orders, commissions, payouts, referrals, and access‑controlled CRUD operations with persistent maps and counters.",
  "feature_evidence.json": "Empty feature evidence report JSON placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference or tooling.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React entry configuring TanStack Router, authentication gating, layout, and all route components.",
  "frontend/src/components/common/QueryState.tsx": "Reusable loading, error, and empty state UI components.",
  "frontend/src/components/formatters/moneyTime.ts": "Utility functions formatting bigint currency and timestamps.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout with navigation, content container, and authenticated footer.",
  "frontend/src/components/layout/AppNav.tsx": "Responsive navigation bar with user menu, admin links, and logout handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal form for creating a user profile with optional referral handling and saving via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for user profiles, referrals, admin checks, products, and orders via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark mode theme variables and utilities.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with navigation back to the dashboard for unauthorized users.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface to view, create, and edit products with access control and form dialogs.",
  "frontend/src/pages/admin/AdminPayoutsPage.tsx": "Admin page that lists payout requests, lets admins approve or reject them, and shows pending and processed payouts.",
  "frontend/src/pages/CatalogItemPage.tsx": "Product detail page allowing authenticated users to view item info and place an order.",
  "frontend/src/pages/CatalogPage.tsx": "Displays product and service listings fetched from the backend, with navigation to item details and redirects when unauthenticated.",
  "frontend/src/pages/DashboardPage.tsx": "Loads user profile, referrals, earnings, and orders to present a business overview with referral link copying.",
  "frontend/src/pages/EarningsPage.tsx": "Shows balance and commission totals and provides a filterable commission history table.",
  "frontend/src/pages/NetworkPage.tsx": "Displays network statistics and a table of downline members with their profiles and levels.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a simple 404 page with a button to return home.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and displays detailed information about a specific order, including product data and totals.",
  "frontend/src/pages/OrdersPage.tsx": "Displays a user's order history with product info, status, and navigation to order details.",
  "frontend/src/pages/PayoutsPage.tsx": "Shows earnings and payout requests, allowing users to submit new withdrawal requests.",
  "frontend/src/pages/ProfilePage.tsx": "Loads and edits the user's profile information with save and cancel options.",
  "frontend/src/pages/ReferralsPage.tsx": "Shows the user's referral code and link and lists direct referrals with copy actions.",
  "frontend/src/pages/SignInPage.tsx": "Provides an Internet Identity sign-in flow and redirects authenticated users.",
  "frontend/src/utils/referrals.ts": "Utilities for building referral links, extracting referral codes from the URL, and copying text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, fonts, and plugins for the frontend.",
  "project_state.json": "Project metadata describing versions, high-level goals, implemented features, and architectural notes for the app."
}