{
  "kind": "build_request",
  "title": "Replace onboarding referral-code input with Upline Associate ID Number (conditional + validated)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update the profile setup/onboarding modal (frontend/src/components/profile/ProfileSetupModal.tsx) to completely remove the input labeled \"Your Referral Code\" and replace it with an input labeled \"Upline Associate ID Number\" that is only shown and required when the user is joining via referral (i.e., when a referral indicator is present from the URL, such as the existing \"ref\" parameter).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "remove \"your referral code\" and add upline associate id number.",
          "upline id number only required when joining via referral."
        ]
      },
      "acceptanceCriteria": [
        "When the onboarding modal is opened without a referral context, there is no field labeled \"Your Referral Code\" and there is no \"Upline Associate ID Number\" field shown/required.",
        "When the onboarding modal is opened with a referral context (existing URL \"ref\" parameter), the modal shows an input labeled exactly \"Upline Associate ID Number\" and the form cannot be submitted unless it is non-empty.",
        "All user-facing text added/changed by this requirement is in English."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Change onboarding submission behavior so that when joining via referral it submits the upline associate ID number and handles validation errors by showing a clear English error toast/message; when not joining via referral, onboarding should not require or submit any upline associate ID number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "the system validate that the entered Upline Associate ID Number matches an existing associate ID in the system if they joining via referral."
        ]
      },
      "acceptanceCriteria": [
        "If the user attempts to submit in referral context with an empty upline associate ID number, the UI shows an English validation error and no backend mutation is executed.",
        "If the backend rejects the upline associate ID number as invalid/non-existent, the UI shows an English error message and the profile is not created.",
        "If the upline associate ID number is valid, the profile is created successfully and the UI shows an English success message."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add backend support to register a new associate using an upline associate ID number (Text) during referral-based onboarding: validate that the provided upline associate ID exists in the existing associateIds index (backend/main.mo), and when valid, link the new user’s referrer/upline accordingly (set referredBy and create the referrals mapping so downline/direct referrals work). Keep existing referral-code-based registration behavior intact for any existing flows that still use it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "the system validate that the entered Upline Associate ID Number matches an existing associate ID in the system if they joining via referral."
        ]
      },
      "acceptanceCriteria": [
        "There is a backend entry point that takes (profile: UserProfile, uplineAssociateId: Text) for referral-based registration and traps with an English error when uplineAssociateId is not found in associateIds.",
        "When uplineAssociateId is valid, the created profile has referredBy set to the upline principal and the referrals map is updated so that the upline sees the new user in getDirectReferrals().",
        "Existing backend method registerWithReferral(profile, referrerCode) continues to function as before (no breaking changes to its signature/behavior)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update the frontend React Query layer (frontend/src/hooks/useQueries.ts) to call the new backend registration method for referral-based onboarding using the upline associate ID number, while preserving the existing useRegisterWithReferral hook for any other screens/flows that still rely on it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "replace Upline associate id number. upline id number only required when joining via referral."
        ]
      },
      "acceptanceCriteria": [
        "A new mutation hook (or an update to onboarding wiring) exists that calls the new backend method with { profile, uplineAssociateId } when in referral context.",
        "On successful registration via upline associate ID, the ['currentUserProfile'] query is invalidated/refetched (same as existing behavior).",
        "No changes are made to the immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not edit any frontend paths listed as immutable in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Use English for any user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Removing the referral program feature from the app (referral links/codes can continue to exist elsewhere, e.g., the Referrals page).",
    "Redesigning the Referrals page, Network page, earnings logic, or commission/bonus calculations beyond what is necessary to support upline-associate-id-based onboarding.",
    "Changing the UserProfile schema fields beyond what is necessary for the new registration flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}