{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace onboarding referral-code input with conditional Upline Associate ID Number + validated submission",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "In ProfileSetupModal, remove the \"Your Referral Code\" field and add a conditional \"Upline Associate ID Number\" field shown/required only when a referral context is detected from the URL (ref param).",
      "acceptanceCriteria": [
        "When the onboarding modal is opened without a referral context, there is no field labeled \"Your Referral Code\" and there is no \"Upline Associate ID Number\" field shown/required.",
        "When the onboarding modal is opened with a referral context (existing URL \"ref\" parameter), the modal shows an input labeled exactly \"Upline Associate ID Number\" and the form cannot be submitted unless it is non-empty.",
        "All user-facing text added/changed by this requirement is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Remove the existing \"Your Referral Code\" <Label>/<Input> and related state; add new state for uplineAssociateId and render an input labeled exactly \"Upline Associate ID Number\" only when a referral indicator is present (using the existing ref URL parameter as the referral context flag). Ensure the upline field is marked required only in referral context, and ensure no upline field is shown when not in referral context."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update onboarding submit logic to send upline associate ID only in referral context, enforce client-side required validation, and show clear English success/error messages including backend validation failures.",
      "acceptanceCriteria": [
        "If the user attempts to submit in referral context with an empty upline associate ID number, the UI shows an English validation error and no backend mutation is executed.",
        "If the backend rejects the upline associate ID number as invalid/non-existent, the UI shows an English error message and the profile is not created.",
        "If the upline associate ID number is valid, the profile is created successfully and the UI shows an English success message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Update handleSubmit to: (1) validate required fields with conditional validation for uplineAssociateId only when in referral context; (2) when in referral context, call the new upline-based registration mutation (added in REQ-26) and do not submit any upline value outside referral context; (3) show English toast messages for empty upline validation, backend rejection/errors, and success. Ensure that on empty upline in referral context the submit returns early without executing any mutation. Also ensure the profile payload still supplies required UserProfile fields (e.g., populate referralCode without a user-entered field, per existing app expectations)."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Extend the React Query layer to support referral-based onboarding via upline associate ID using the new backend method, without breaking existing registerWithReferral usage.",
      "acceptanceCriteria": [
        "A new mutation hook (or an update to onboarding wiring) exists that calls the new backend method with { profile, uplineAssociateId } when in referral context.",
        "On successful registration via upline associate ID, the ['currentUserProfile'] query is invalidated/refetched (same as existing behavior).",
        "No changes are made to the immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., useRegisterWithUplineId) that calls actor.registerWithUplineId(profile, uplineAssociateId) via a mutationFn, and onSuccess invalidates ['currentUserProfile'] (matching existing behavior). Keep the existing useRegisterWithReferral hook intact for other flows."
        },
        {
          "path": "frontend/src/components/profile/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Wire the modal submission logic to use the new upline-based registration hook in referral context, while preserving the existing non-referral saveCallerUserProfile path when not in referral context."
        }
      ]
    }
  ]
}